<script setup lang="ts">
import Border from '../components/BorderItem.vue'
</script>

<template>
  <p>コンテンツ内aaa容</p>
  <h1>aa</h1>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>
  <p>コンテンツ内容</p>

  <!--<Border />
 -->
</template>

<style scoped>
footer {
  position: fixed;
  bottom: 0;
  width: 100%;
  height: 5vh;
  z-index: 100;
}

body {
  padding-bottom: 5vh;
}
</style>
